use master;
create database ПРОДАЖИ;

use ПРОДАЖИ
create table ТОВАРЫ(
  Наименование nvarchar(20) primary key,
  Цена real unique not null,
  Количество int,
);

create table ЗАКАЗЧИКИ(
  Наименование_фирмы nvarchar(20) primary key,
  Адрес nvarchar(50),
  Расчетный_счет nvarchar(20)
);

create table ЗАКАЗЫ(
  Наименование_заказа int primary key,
  Наименование_товара nvarchar(20),
  Цена_продажи real,
  Количество int,
  Дата_поставки date,
  Заказчик nvarchar(20),
  FOREIGN KEY (Наименование_товара) REFERENCES ТОВАРЫ(Наименование),
  FOREIGN KEY (Заказчик) REFERENCES ЗАКАЗЧИКИ(Наименование_фирмы),
);

insert into ТОВАРЫ
values
('Товар1', 1, 1),
('Товар2', 2, 2),
('Товар3', 3, 3),
('Товар4', 4, 4),
('Товар5', 5, 5);

insert into ЗАКАЗЧИКИ
values
('Заказчик1', '1', '2342341'),
('Заказчик2', '2', '2234234234'),
('Заказчик3', '3', '323423423'),
('Заказчик4', '4', '44234234'),
('Заказчик5', '4', '542342342');

insert into ЗАКАЗЫ
values
(1, 'Товар1', 123, 12, '01.01.2025', 'Заказчик1'),
(2, 'Товар2', 123, 12, '01.01.2025', 'Заказчик2'),
(3, 'Товар3', 123, 12, '01.01.2025', 'Заказчик1'),
(4, 'Товар1', 123, 12, '01.01.2025', 'Заказчик3')

select Наименование from ТОВАРЫ where Цена < 5;
update ТОВАРЫ set Цена = 500 where Наименование = 'Товар2';

alter table ТОВАРЫ add Дата_поступления date default '2025' check(Дата_поступления in ('2024','2025'));
alter table ТОВАРЫ drop Дата_поступления;